OpenFOAM_Maincode/tutorials/multiphaseEuler/pipeBend/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          multiphaseEuler;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          0.003;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;

maxDeltaT       1;

functions
{
    #includeFunc writeObjects(d.particles)

    #includeFunc populationBalanceSizeDistribution
    (
        name=probabilityDensity.afterBend_1d,
        populationBalance=agglomerates,
        select=cellZone,
        cellZone=afterBend_1d,
        functionType=volumeDensity,
        coordinateType=diameter,
        normalise=yes
    )

    #includeFunc populationBalanceSizeDistribution
    (
        name=probabilityDensity.afterBend_5d,
        populationBalance=agglomerates,
        select=cellZone,
        cellZone=afterBend_5d,
        functionType=volumeDensity,
        coordinateType=diameter,
        normalise=yes
    )

    #includeFunc populationBalanceSizeDistribution
    (
        name=probabilityDensity.afterBend_9d,
        populationBalance=agglomerates,
        select=cellZone,
        cellZone=afterBend_9d,
        functionType=volumeDensity,
        coordinateType=diameter,
        normalise=yes
    )

    #includeFunc populationBalanceSizeDistribution
    (
        name=probabilityDensity.beforeBend_1d,
        populationBalance=agglomerates,
        select=cellZone,
        cellZone=beforeBend_1d,
        functionType=volumeDensity,
        coordinateType=diameter,
        normalise=yes
    )
}


// ************************************************************************* //
